In [31]:
import psycopg

In [32]:
conn = psycopg.connect(
    host="analytics.cifysgssswkf.us-east-1.rds.amazonaws.com",
    port=5432,
    dbname="postgres",
    user="postgres",
    password="kigrax-9Kaqje-vuxmav"
)

cur = conn.cursor()

In [33]:
import time
import pandas as pd
import dask.dataframe as dd
from sqlalchemy import create_engine
import os

In [34]:
# Source - https://stackoverflow.com/a
# Posted by DanGD, modified by community. See post 'Timeline' for change history
# Retrieved 2025-11-28, License - CC BY-SA 4.0
!pip install pyarrow

Requirement already satisfied: pyarrow in ./.venv/lib/python3.12/site-packages (22.0.0)

### Метод 1

In [48]:
DB_URI = "postgresql+psycopg://postgres:kigrax-9Kaqje-vuxmav@analytics.cifysgssswkf.us-east-1.rds.amazonaws.com:5432/postgres"

In [36]:
engine = create_engine(DB_URI)

In [37]:
files = [
    "info", "gadm", "ghsl", 
    "instances", "metadata", 
    "perception", "places365"
]

for name in files:
    df = pd.read_csv(f"data/{name}.csv")
    df.to_sql(name, engine, if_exists="replace", index=False)
    print("Loaded:", name)

Loaded: info
Loaded: gadm
Loaded: ghsl
Loaded: instances
Loaded: metadata
Loaded: perception
Loaded: places365

### Метод 2

In [39]:
engine = create_engine(DB_URI)

df = dd.read_csv("data/metadata.csv")
df.to_sql("metadata", DB_URI, if_exists='replace')

print("DONE!")

DONE!

### Метод 3

In [40]:
!csvsql -i postgresql data/places365.csv

CREATE TABLE places365 (
	uuid VARCHAR NOT NULL,
	source VARCHAR NOT NULL,
	orig_id DECIMAL NOT NULL,
	place VARCHAR NOT NULL
);

In [41]:
import psycopg

conn = psycopg.connect(
    "postgresql://postgres:kigrax-9Kaqje-vuxmav@analytics.cifysgssswkf.us-east-1.rds.amazonaws.com:5432/postgres"
)

with conn, conn.cursor() as cur:
    with open("data/places365.csv", "r") as f:
        with cur.copy("COPY places365 FROM STDIN WITH (FORMAT CSV, HEADER)") as copy:
            for line in f:
                copy.write(line)

print("DONE!")

DONE!

### Task 2

In [52]:
from sqlalchemy import create_engine

DB_URI = "postgresql+psycopg://postgres:kigrax-9Kaqje-vuxmav@analytics.cifysgssswkf.us-east-1.rds.amazonaws.com:5432/postgres"
engine = create_engine(DB_URI)

In [53]:
import psycopg

DB = "user=postgres password=kigrax-9Kaqje-vuxmav host=analytics.cifysgssswkf.us-east-1.rds.amazonaws.com port=5432 dbname=postgres"
conn = psycopg.connect(DB)
cur = conn.cursor()

In [55]:
import pandas as pd

tables = ["info", "gadm", "ghsl", "instances", "metadata", "perception", "places365"]

for t in tables:
    print("Loading:", t)
    df = pd.read_csv(f"data/{t}.csv")
    df.to_sql(t, engine, if_exists="replace", index=False)
    print("Loaded:", t)

Loading: info
Loaded: info
Loading: gadm
Loaded: gadm
Loading: ghsl
Loaded: ghsl
Loading: instances
Loaded: instances
Loading: metadata
Loaded: metadata
Loading: perception
Loaded: perception
Loading: places365
Loaded: places365

In [56]:
for t in tables:
    try:
        d = pd.read_sql(f"SELECT * FROM {t} LIMIT 1", engine)
        print(t, ":", list(d.columns))
    except Exception as e:
        print("ERROR in", t, ":", e)

info : ['Unnamed: 0', 'Filename', 'Overview', 'Notes', 'Field', 'Format', 'Explanation']
gadm : ['uuid', 'source', 'orig_id', 'GID_0', 'COUNTRY', 'CC_1', 'ENGTYPE_1', 'GID_1', 'HASC_1', 'ISO_1', 'NAME_1', 'NL_NAME_1', 'TYPE_1', 'VARNAME_1', 'CC_2', 'ENGTYPE_2', 'GID_2', 'HASC_2', 'NAME_2', 'NL_NAME_2', 'TYPE_2', 'VARNAME_2', 'CC_3', 'ENGTYPE_3', 'GID_3', 'HASC_3', 'NAME_3', 'NL_NAME_3', 'TYPE_3', 'VARNAME_3', 'CC_4', 'ENGTYPE_4', 'GID_4', 'NAME_4', 'TYPE_4', 'VARNAME_4', 'CC_5', 'ENGTYPE_5', 'GID_5', 'NAME_5', 'TYPE_5']
ghsl : ['uuid', 'source', 'orig_id', 'urban_code', 'urban_term']
instances : ['uuid', 'source', 'orig_id', 'Bird', 'Ground-Animal', 'Curb', 'Fence', 'Guard-Rail', 'Barrier', 'Wall', 'Bike-Lane', 'Crosswalk---Plain', 'Curb-Cut', 'Parking', 'Pedestrian-Area', 'Rail-Track', 'Road', 'Service-Lane', 'Sidewalk', 'Bridge', 'Building', 'Tunnel', 'Person', 'Bicyclist', 'Motorcyclist', 'Other-Rider', 'Lane-Marking---Crosswalk', 'Lane-Marking---General', 'Mountain', 'Sand', 'Sky', 'Snow', 'Terrain', 'Vegetation', 'Water', 'Banner', 'Bench', 'Bike-Rack', 'Billboard', 'Catch-Basin', 'CCTV-Camera', 'Fire-Hydrant', 'Junction-Box', 'Mailbox', 'Manhole', 'Phone-Booth', 'Pothole', 'Street-Light', 'Pole', 'Traffic-Sign-Frame', 'Utility-Pole', 'Traffic-Light', 'Traffic-Sign-(Back)', 'Traffic-Sign-(Front)', 'Trash-Can', 'Bicycle', 'Boat', 'Bus', 'Car', 'Caravan', 'Motorcycle', 'On-Rails', 'Other-Vehicle', 'Trailer', 'Truck', 'Wheeled-Slow', 'Car-Mount', 'Ego-Vehicle']
metadata : ['uuid', 'source', 'orig_id', 'lat', 'lon', 'datetime_local', 'year', 'month', 'day', 'hour', 'width', 'height', 'heading', 'projection_type', 'hFoV', 'vFoV', 'sequence_index', 'sequence_id', 'sequence_img_count']
perception : ['uuid', 'source', 'orig_id', 'Beautiful', 'Boring', 'Depressing', 'Lively', 'Safe', 'Wealthy']
places365 : ['uuid', 'source', 'orig_id', 'place']

In [57]:
pk_tables = ["gadm", "ghsl", "instances", "metadata", "perception", "places365"]

for t in pk_tables:
    cur.execute(f"ALTER TABLE {t} ADD PRIMARY KEY (uuid);")
    print("PK created:", t)

conn.commit()

PK created: gadm
PK created: ghsl
PK created: instances
PK created: metadata
PK created: perception
PK created: places365

In [58]:
child_tables = ["gadm", "ghsl", "instances", "perception", "places365"]

for t in child_tables:
    cur.execute(f"""
        ALTER TABLE {t}
        ADD CONSTRAINT {t}_uuid_fkey
        FOREIGN KEY (uuid)
        REFERENCES metadata(uuid);
    """)
    print("FK added:", t)

conn.commit()

FK added: gadm
FK added: ghsl
FK added: instances
FK added: perception
FK added: places365

### Task 3

#### 3.1.1

In [66]:
q1 = """
SELECT 
    g.urban_term,
    AVG(p."Beautiful") AS avg_beautiful,
    AVG(p."Boring") AS avg_boring,
    AVG(p."Depressing") AS avg_depressing,
    AVG(p."Lively") AS avg_lively,
    AVG(p."Safe") AS avg_safe,
    AVG(p."Wealthy") AS avg_wealthy
FROM ghsl g
JOIN perception p USING(uuid)
GROUP BY g.urban_term
ORDER BY g.urban_term;
"""

df1 = pd.read_sql(q1, engine)
df1

,urban_term,avg_beautiful,avg_boring,avg_depressing,avg_lively,avg_safe,avg_wealthy
0,dense urban cluster,4.909224,4.470030,4.876657,5.315761,3.181612,3.611552
1,low density rural,4.947568,4.478446,5.077095,4.199189,3.313784,2.945270
2,rural cluster,6.230826,5.211074,4.254380,5.093306,4.784132,4.158099
3,semi-dense urban cluster,4.758618,4.191504,4.801016,5.347642,3.731911,3.552236
4,suburban or peri-urban,4.680070,4.406440,5.121475,3.942506,2.959532,3.134215
5,urban centre,4.714735,3.536237,4.474078,6.231560,3.712786,4.531004
6,very low density rural,4.436809,5.162553,4.934681,3.458723,3.363191,2.710638
7,water,2.105000,7.995000,4.980000,1.755000,2.270000,3.795000

#### 3.1.2

In [70]:
q_place = """
SELECT 
    pl.place,
    AVG(p."Beautiful") AS avg_beautiful,
    AVG(p."Boring") AS avg_boring,
    AVG(p."Depressing") AS avg_depressing,
    AVG(p."Lively") AS avg_lively,
    AVG(p."Safe") AS avg_safe,
    AVG(p."Wealthy") AS avg_wealthy
FROM places365 pl
JOIN perception p USING(uuid)
GROUP BY pl.place
ORDER BY pl.place;
"""

df_place = pd.read_sql(q_place, engine)
df_place

,place,avg_beautiful,avg_boring,avg_depressing,avg_lively,avg_safe,avg_wealthy
0,airplane_cabin,4.806667,2.120000,4.113333,6.433333,2.713333,6.200000
1,airport_terminal,3.233333,3.911667,4.322500,4.899167,2.032917,3.644167
2,alley,4.049555,4.095045,4.610475,6.209110,3.376261,4.168368
3,amphitheater,4.441143,3.649714,5.070571,4.723143,2.133714,4.008571
4,amusement_arcade,4.580000,3.680000,8.840000,5.430000,0.730000,4.270000
...,...,...,...,...,...,...,...
211,water_park,4.412581,3.161613,5.652258,5.218710,1.835484,3.877097
212,water_tower,3.711667,4.086667,4.881667,3.556667,3.180000,2.893333
213,windmill,2.170000,5.030000,4.840000,2.616667,1.470000,1.196667
214,yard,6.032222,5.673333,3.678889,4.478889,6.538889,4.675556
215,zen_garden,5.533571,4.367500,4.396786,4.841071,3.947500,4.193571

#### 3.1.3

In [69]:
q_country = """
SELECT 
    g."COUNTRY",
    AVG(p."Beautiful") AS avg_beautiful,
    AVG(p."Boring") AS avg_boring,
    AVG(p."Depressing") AS avg_depressing,
    AVG(p."Lively") AS avg_lively,
    AVG(p."Safe") AS avg_safe,
    AVG(p."Wealthy") AS avg_wealthy
FROM gadm g
JOIN perception p USING(uuid)
GROUP BY g."COUNTRY"
ORDER BY g."COUNTRY";
"""

df_country = pd.read_sql(q_country, engine)
df_country

,COUNTRY,avg_beautiful,avg_boring,avg_depressing,avg_lively,avg_safe,avg_wealthy
0,Albania,3.952449,3.785102,5.426939,6.663061,3.227347,4.166327
1,Algeria,4.272857,2.175714,4.601429,6.817143,3.300000,5.368571
2,Andorra,5.028000,7.184000,4.744000,6.686000,2.234000,2.420000
3,Angola,4.032105,3.724211,5.752632,6.344737,4.015789,3.241579
4,Antigua and Barbuda,3.455714,4.150000,4.322857,4.725714,2.642857,3.075714
...,...,...,...,...,...,...,...
171,Vietnam,4.328200,3.086400,5.022800,6.871800,4.956600,3.991400
172,"Virgin Islands, U.S.",4.491000,4.509000,3.658000,5.836000,1.649000,2.210000
173,Zambia,6.250000,2.825000,5.510000,8.480000,4.855000,5.535000
174,Zimbabwe,1.764000,2.914000,4.984000,5.394000,2.080000,3.128000
175,None,4.529474,3.918158,4.312895,5.186053,3.525263,4.897368

#### 3.2

In [71]:
q_mv = """
CREATE MATERIALIZED VIEW total_instances_by_level2 AS
SELECT
    g."NAME_2" AS area_name,
    SUM(value::int) AS total_objects
FROM instances i
JOIN gadm g USING (uuid),
LATERAL jsonb_each_text(
    to_jsonb(i) - 'uuid' - 'source' - 'orig_id'
) AS each(key, value)
GROUP BY g."NAME_2"
ORDER BY total_objects DESC;
"""

cur.execute(q_mv)
conn.commit()
print("Materialized view created!")

Materialized view created!

In [72]:
pd.read_sql("SELECT * FROM total_instances_by_level2 LIMIT 20;", engine)

               area_name  total_objects
0                   None          26222
1           Kuala Lumpur          11287
2              São Paulo           9005
3                 Taipei           8470
4                 Berlin           8389
5                Central           6567
6              Budapesti           5842
7         Rio de Janeiro           4970
8                   Riga           4766
9            Bogotá D.C.           4645
10         Aizuwakamatsu           4443
11             Baltimore           4338
12                Attica           4192
13                  King           4093
14  District of Columbia           4057
15                  Lima           3762
16       Jakarta Selatan           3656
17           Los Angeles           3619
18                Manila           3410
19             Melbourne           3356

In [73]:
pd.read_sql("""
SELECT * 
FROM total_instances_by_level2
WHERE area_name IS NOT NULL
ORDER BY total_objects DESC;
""", engine)

         area_name  total_objects
0     Kuala Lumpur          11287
1        São Paulo           9005
2           Taipei           8470
3           Berlin           8389
4          Central           6567
..             ...            ...
471  Tomskiy rayon             11
472     Dili Barat             10
473         Dezful              7
474       Mbumburu              6
475         Fulton              2

[476 rows x 2 columns]